##################Задание № 1.1#######################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
if "карта" in backpack:
    i = backpack.index("карта")
    print(i)
    backpack[i] = "навигатор"
print(backpack)
#######################Задание № 1.2##################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
backpack.append("веревка")
print(backpack)
################Задание№ 1.3 #######################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
backpack.reverse()
print(backpack)
i = backpack[::-1]
print(i)
###############Задание № 1.4########################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
backpack.remove("телевизор")
print(backpack)
########Задание № 1.5 ############################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
i = len(backpack) // 2
backpack.insert(i,"бутылка для воды")
print(backpack)
############Задание № 1.6 ########################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
i = backpack.count("фонарик")
b = backpack.count("горелка")
print(f"Фонариков всего:", i)
print(f"Горелок всего:", b)
############Задание № 1.7 ##################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
i = len(backpack)
print(f"Количество вещей в рюкзаке: ", i)
###########Задание № 1.8 ###############
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
i = backpack.pop()
print(backpack)
###########Задание № 1.9 ###############
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
copy = backpack.copy()
print(copy)
copy.append("нож")
print(backpack)
print(copy)
copy.remove("нож")
print(copy)
###########Задание № 1.10#####################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
uniqum_backpack = []
povtory_backpack = []
for item in backpack:
    if item in uniqum_backpack:
        povtory_backpack.append(item)
    else:
        uniqum_backpack.append(item)
print("Рюкзак без дублей: ", uniqum_backpack)
print("Рюкзак с дублями: ", povtory_backpack)
############### Задание № 1.11 ###########################
backpack = ['палатка', 'спальник', 'рюкзак', 'горелка', 'дождевик', 'фонарик', 'карта', 'компас', 'спички', 'горелка', 'телевизор', 'фонарик']
backpack2 = backpack.copy()
i = backpack[::-1]
five = backpack[:5]
for item in five:
    backpack2.append(item)
print(f"Содержимое первого рюкзака: ", i)
print(f"Содержимое второго рюкзака: ", backpack2)
######## Задание № 2.1 ###############
spisok = ['фонарик', 'горелка', 'фонарик', 'спички', 'спальник', 'рюкзак', 'навигатор']
spisok2 = []
for item in spisok:
    spisok2.append(len(item))
print(spisok2)
#######Задание № 2.2##############
backpack = ['фонарик', 'горелка', 'фонарик', 'спички', 'спальник', 'рюкзак', 'навигатор']
spisok2 = []
for item in backpack:
    if len(item) % 2 == 0:
        spisok2.append(item)
print(spisok2)
#########Задание № 2.3#############
spisok = ['фонарик', 'горелка', 'фонарик', 'спички', 'спальник', 'рюкзак', 'навигатор']
spisok2 = []
for i in range(len(spisok)):
    spisok2.append(f"{i}: {spisok[i]}")
print(spisok2)
######Задание № 2.4 ##############
spisok = ['фонарик', 'горелка', 'фонарик', 'спички', 'спальник', 'рюкзак', 'навигатор']
for i in range(len(spisok)):
    spisok[i] = spisok[i][::-1]
print(spisok)
##########Задание № 2.5 #############
spisok = ['фонарик', 'горелка', 'фонарик', 'спички', 'спальник', 'рюкзак', 'навигатор']
spisok2 = []
for item in spisok:
    spisok2.append(item[0])
print(spisok2)